In [1]:
import os    # work with paths, folders, files
import sys
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
sys.path.append(os.path.abspath("../utils"))

### Reading CSV file

In [3]:
# Importing load_csv function from read_data module
from read_data import load_csv
cars = load_csv('scrape_data', 'scrape_data.csv')
cars.head()

,model_name,km_driven,fuel_type,transmission,owner,engine_capacity,price,link
0,2013 Hyundai Eon,46.61k km,Petrol,Manual,3rd,814cc,₹1.76 lakh,https://www.cars24.com/buy-used-hyundai-eon-20...
1,2014 Maruti Alto 800,72.11k km,Petrol,Manual,2nd,796cc,₹2.12 lakh,https://www.cars24.com/buy-used-maruti-alto-80...
2,2015 Maruti Wagon R 1.0,44.48k km,Petrol,Manual,1st,998cc,₹3.37 lakh,https://www.cars24.com/buy-used-maruti-wagon-r...
3,2018 Tata Tiago,75.34k km,Petrol,NaN,1st,1199cc,₹4.46 lakh,https://www.cars24.com/buy-used-tata-tiago-201...
4,2012 Hyundai i20,69.74k km,Petrol,Manual,2nd,1197cc,₹2.63 lakh,https://www.cars24.com/buy-used-hyundai-i20-20...

In [4]:
cars.shape

(4870, 8)

### Dropping Unnecessary Columns

---

In [5]:
cars.drop('link', axis=1,inplace=True)

### Summary of the DataFrame

---

In [6]:
from summary import dataframe_summary
dataframe_summary(cars)

======================================================================
                          DataFrame Summary
======================================================================
Shape: 4870 rows × 7 columns
======================================================================
Duplicate Rows: 2
======================================================================
Memory Usage: 2.29MB
======================================================================
Missing Values:
                 Missing Values      %
fuel_type                     3   0.06
transmission               1337  27.45
engine_capacity             380   7.80
======================================================================
DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4870 entries, 0 to 4869
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   model_name       4870 non-null   object
 1   km_driven        4870 non-null   object
 2   fuel_type        4867 non-null   object
 3   transmission     3533 non-null   object
 4   owner            4870 non-null   object
 5   engine_capacity  4490 non-null   object
 6   price            4870 non-null   object
dtypes: object(7)
memory usage: 266.5+ KB
======================================================================
DataFrame Description:
No numerical columns in the dataframe

### Cleaning `model_name` Column

---

In [7]:
# "model_name" contains multiple information about cars :
# -> manufacturing year of cars (like 2019, 2021)
# -> brand name of cars (like Maruti, Tata)
# -> model name of cars (like Alto 800, Tiago)
# So we will extract all these information from "model_name" column
cars['model_name'].head()

0           2013 Hyundai Eon
1       2014 Maruti Alto 800
2    2015 Maruti Wagon R 1.0
3            2018 Tata Tiago
4           2012 Hyundai i20
Name: model_name, dtype: object

In [8]:
cars['model_name'].str.strip().str.split(' ',n=1).str.get(0).head()

0    2013
1    2014
2    2015
3    2018
4    2012
Name: model_name, dtype: object

In [9]:
cars['model_name'].str.strip().str.split(' ',n=1).str.get(0).unique()     # manufacturing year of cars  
                                                                          # trim spaces → split on first space → take the first token (e.g., “2019”).

array(['2013', '2014', '2015', '2018', '2012', '2022', '2019', '2021',
       '2020', '2023', '2017', '2024', '2016', '2010', '2011', '2007',
       '2025'], dtype=object)

In [10]:
cars['year']=cars['model_name'].str.strip().str.split(' ', n=1).str.get(0).astype(int)
cars.head()

,model_name,km_driven,fuel_type,transmission,owner,engine_capacity,price,year
0,2013 Hyundai Eon,46.61k km,Petrol,Manual,3rd,814cc,₹1.76 lakh,2013
1,2014 Maruti Alto 800,72.11k km,Petrol,Manual,2nd,796cc,₹2.12 lakh,2014
2,2015 Maruti Wagon R 1.0,44.48k km,Petrol,Manual,1st,998cc,₹3.37 lakh,2015
3,2018 Tata Tiago,75.34k km,Petrol,NaN,1st,1199cc,₹4.46 lakh,2018
4,2012 Hyundai i20,69.74k km,Petrol,Manual,2nd,1197cc,₹2.63 lakh,2012

In [11]:
# brand name of cars
cars['model_name'].str.strip().str.split(' ').str.get(1).head()

0    Hyundai
1     Maruti
2     Maruti
3       Tata
4    Hyundai
Name: model_name, dtype: object

In [12]:
# Checking if there are any garbage values after extracting brand name details
cars['model_name'].str.strip().str.split(' ').str.get(1).unique()

array(['Hyundai', 'Maruti', 'Tata', 'KIA', 'Renault', 'Volkswagen',
       'Datsun', 'Skoda', 'Nissan', 'Honda', 'Toyota', 'Jeep', 'MG',
       'Ford', 'Mahindra', 'Jaguar', 'Fiat', 'Landrover', 'Chevrolet',
       'BMW', 'Premier', 'Audi', 'Mercedes', 'Mitsubishi', 'CITROEN',
       'Mini', 'Ashok', 'Force', 'Ssangyong', 'Volvo', 'ISUZU'],
      dtype=object)

In [13]:
# Creating "brand" column to keep details about brand name of cars
cars['brand'] = cars['model_name'].str.split(' ').str.get(1)
cars.head()

,model_name,km_driven,fuel_type,transmission,owner,engine_capacity,price,year,brand
0,2013 Hyundai Eon,46.61k km,Petrol,Manual,3rd,814cc,₹1.76 lakh,2013,Hyundai
1,2014 Maruti Alto 800,72.11k km,Petrol,Manual,2nd,796cc,₹2.12 lakh,2014,Maruti
2,2015 Maruti Wagon R 1.0,44.48k km,Petrol,Manual,1st,998cc,₹3.37 lakh,2015,Maruti
3,2018 Tata Tiago,75.34k km,Petrol,NaN,1st,1199cc,₹4.46 lakh,2018,Tata
4,2012 Hyundai i20,69.74k km,Petrol,Manual,2nd,1197cc,₹2.63 lakh,2012,Hyundai

In [14]:
#brand names of the cars
cars['model_name'].str.strip().str.split(' ',n=2).str.get(-1).head()

0            Eon
1       Alto 800
2    Wagon R 1.0
3          Tiago
4            i20
Name: model_name, dtype: object

In [15]:
# Checking if there are any garbage values after extracting model name details
cars['model_name'].str.strip().str.split(' ', n=2).str.get(-1).unique()

array(['Eon', 'Alto 800', 'Wagon R 1.0', 'Tiago', 'i20', 'CARENS',
       'Swift Dzire', 'NEXON', 'TRIBER', 'Kwid', 'Dzire', 'Alto K10',
       'Grand i10', 'Kiger', 'TIGUAN', 'Redi Go', 'Swift', 'Hexa',
       'Baleno', 'Rapid', 'MAGNITE', 'SELTOS', 'Verna', 'Polo', 'Duster',
       'XL6', 'VENUE', 'GRAND I10 NIOS', 'KUSHAQ', 'New Wagon-R',
       'NEW I20', 'Harrier', 'Amaze', 'Micra Active', 'Elite i20', 'Jazz',
       'EXTER', 'Glanza', 'ALTROZ', 'Ciaz', 'VIRTUS', 'Compass', 'HECTOR',
       'City', 'i20 Active', 'Vitara Brezza', 'Ecosport', 'Celerio',
       'BR-V', 'S PRESSO', 'Ameo', 'BREZZA', 'Brio', 'Go', 'NEW SANTRO',
       'YARIS', 'Santro Xing', 'New Figo', 'TIGOR', 'SLAVIA', 'Ritz',
       'SONET', 'Micra', 'XUV500', 'Kicks', 'KUV 100 NXT', 'Thar', 'WR-V',
       'ALCAZAR', 'IGNIS', 'ASTOR', 'Celerio X', 'URBAN CRUISER', 'Creta',
       'i10', 'FRONX', 'PUNCH', 'TAIGUN', 'Alto', 'BOLERO NEO', 'S Cross',
       'Grand Vitara', 'JIMNY', 'HECTOR PLUS', 'Ertiga', 'Superb',
       'Vento', 'Laura', 'Figo', 'XF', 'Nano', 'Bolero', 'Punto EVO',
       'Mobilio', 'Corolla Altis', 'Freelander 2', 'Zen Estilo', 'Xcent',
       'Verito', 'Sunny', 'Fiesta', 'Beat', 'TIAGO NRG', 'Linea',
       'XUV700', 'Indica EV2', 'Figo Aspire', 'Indigo ECS', 'Wagon R',
       'URBAN CRUISER HYRYDER', 'Tucson', 'NEXON EV', 'Terrano', 'SX4',
       'Indica V2', 'Manza', 'Innova', 'New Elantra', 'Grand Punto',
       '5 Series', 'Xylo', 'Indica Vista', 'Kuv100', 'Etios Liva',
       'ELEVATE', 'Fabia', 'Safari', 'MARAZZO', 'FREESTYLE', 'XUV300',
       'Eeco', 'A Star', 'Zest', 'Captur', 'Urban Cruiser Taisor',
       'SCORPIO-N', 'Innova Crysta', 'Cruze', 'Civic', 'Etios',
       'Endeavour', 'Sail', 'NEW I20 N LINE', 'Safari Storme',
       'Cross Polo', 'Fiesta Classic', 'Go Plus', 'Spark', 'Rio',
       'Indicab', 'Aria', 'Q5', 'Octavia', 'Captiva', 'Scala',
       'Benz C Class', 'Bolt', 'Pajero Sport', 'E2O', 'Scorpio', 'TUV300',
       'AURA', 'Passat', 'C3', 'COMET', 'Cooper Countryman',
       'Verito Vibe CS', '3 Series', 'Lodgy', 'Enjoy', 'OMNI E',
       'XUV 3XO', 'Classic', 'E20 Plus', 'X1', 'Leyland Stile',
       '7 Series', 'Fortuner', 'Pulse', 'Thar Roxx', 'A4',
       'Motors GURKHA', 'Motors Force One', 'Q3', '2 SERIES GRAN COUPE',
       'TIAGO EV', 'TIAGO JTP', 'Quanto', 'Yeti', 'Benz CLA Class', 'A3',
       'Benz GLA Class', 'Santa Fe', 'E C3', 'Benz B Class', 'PUNCH EV',
       'A6', 'E VERITO', 'Q7', 'ZS EV', 'Benz Ml Class', 'RUMION',
       'Benz GL Class', 'Creta N Line', 'KONA ELECTRIC', 'ALTURAS G4',
       'TIGOR EV', 'T-ROC', 'Jetta', 'SCORPIO CLASSIC', 'Aveo U VA',
       'Range Rover Evoque', 'Accent', 'Aveo', 'Sail UVA', 'Rexton', 'X3',
       'CRV', 'F- PACE', 'XCENT PRIME', 'XC 60', 'iX', 'Camry',
       'CARNIVAL', 'WRANGLER', 'MERIDIAN', 'Benz GLC CLASS', 'MU-X',
       'D-Max V Cross', 'Discovery 4'], dtype=object)

In [16]:
# Creating "model" column to keep details about model name of cars
cars['model'] = cars['model_name'].str.strip().str.split(' ', n=2).str.get(-1)
cars.head()

,model_name,km_driven,fuel_type,transmission,owner,engine_capacity,price,year,brand,model
0,2013 Hyundai Eon,46.61k km,Petrol,Manual,3rd,814cc,₹1.76 lakh,2013,Hyundai,Eon
1,2014 Maruti Alto 800,72.11k km,Petrol,Manual,2nd,796cc,₹2.12 lakh,2014,Maruti,Alto 800
2,2015 Maruti Wagon R 1.0,44.48k km,Petrol,Manual,1st,998cc,₹3.37 lakh,2015,Maruti,Wagon R 1.0
3,2018 Tata Tiago,75.34k km,Petrol,NaN,1st,1199cc,₹4.46 lakh,2018,Tata,Tiago
4,2012 Hyundai i20,69.74k km,Petrol,Manual,2nd,1197cc,₹2.63 lakh,2012,Hyundai,i20

In [17]:
# Now we don't need "model_name" column, so we can drop it
cars.drop('model_name', axis=1, inplace=True)

### Cleaning `km_driven` Column

---

In [18]:
# "km_driven" column contains "km" suffix
# To convert "km_driven" into numerical datatype, we have to remove the "km" suffix
cars['km_driven'].head()

0    46.61k km
1    72.11k km
2    44.48k km
3    75.34k km
4    69.74k km
Name: km_driven, dtype: object

In [19]:
# Removing "km" suffix from "km_driven" column
cars['km_driven'] = cars['km_driven'].str.split(' ').str.get(0)
cars['km_driven'].head()

0    46.61k
1    72.11k
2    44.48k
3    75.34k
4    69.74k
Name: km_driven, dtype: object

In [20]:
# There are 2 values in "km_driven" column that don't have any suffix associated with them 
# It might be because of any data collection or web scraping error, so we must remove these values
cars[cars['km_driven'].str.isdigit()]

,km_driven,fuel_type,transmission,owner,engine_capacity,price,year,brand,model
758,533,Petrol,Manual,1st,1199cc,₹11.79 lakh,2024,Tata,NEXON
1117,1,Diesel,Manual,2nd,1998cc,₹3.50 lakh,2015,Chevrolet,Cruze
2394,250,Petrol,Manual,1st,998cc,₹5.37 lakh,2024,Maruti,Alto K10
3016,3,Petrol,Manual,1st,1499cc,₹3.29 lakh,2014,Ford,Ecosport
3062,3,Petrol,Manual,1st,1197cc,₹2.00 lakh,2012,Maruti,Swift
3210,0,Diesel,Manual,1st,1405cc,₹1.11 lakh,2011,Tata,Indica Vista
3232,1,Petrol,Manual,3rd,1197cc,₹1.12 lakh,2010,Maruti,Ritz
3341,2,Petrol,Manual,1st,NaN,₹1.04 lakh,2014,Chevrolet,Beat
3350,61,Petrol,Manual,1st,1373cc,₹4.09 lakh,2013,Maruti,Ertiga
3379,1,Diesel,Manual,3rd,NaN,₹0.86 lakh,2010,Tata,Indica Vista
3384,3,Petrol,Manual,3rd,1199cc,₹0.93 lakh,2011,Chevrolet,Beat
3476,390,Petrol,Manual,1st,1061cc,₹1.39 lakh,2010,Maruti,Wagon R

In [21]:
# Removing values that don't have any suffix associated with them
cars = cars[(cars['km_driven'].str.endswith('k')) | (cars['km_driven'].str.endswith('L'))]

In [22]:
# "km_driven" column contains 2 types of suffix : "k" or "L"
cars['km_driven'].str.get(-1).unique()

array(['k', 'L'], dtype=object)

In [23]:
# Importing km_driven_cleaner function from helpers module
from helpers import km_driven_cleaner

In [24]:
# Applying km_driven_cleaner function on "km_driven" column
cars.loc[:,'km_driven'] = cars.loc[:,'km_driven'].apply(km_driven_cleaner)
cars.head()

,km_driven,fuel_type,transmission,owner,engine_capacity,price,year,brand,model
0,46610,Petrol,Manual,3rd,814cc,₹1.76 lakh,2013,Hyundai,Eon
1,72110,Petrol,Manual,2nd,796cc,₹2.12 lakh,2014,Maruti,Alto 800
2,44480,Petrol,Manual,1st,998cc,₹3.37 lakh,2015,Maruti,Wagon R 1.0
3,75340,Petrol,NaN,1st,1199cc,₹4.46 lakh,2018,Tata,Tiago
4,69740,Petrol,Manual,2nd,1197cc,₹2.63 lakh,2012,Hyundai,i20

### Cleaning `fuel_type` Column

---

In [25]:
# "fuel_type" column has nothing to clean, but to proceed without any error, we can strip the values to remove any extra spaces
cars['fuel_type'] = cars['fuel_type'].str.strip()
cars['fuel_type'].unique()

array(['Petrol', 'Diesel', 'CNG', nan, 'Electric'], dtype=object)

### Cleaning `owner` Column

---

In [26]:
# "owner" column has nothing to clean, but to proceed without any error, we can strip the values to remove any extra spaces

# Step 1: Remove existing ' owner' text if present
#cars['owner'] = cars['owner'].str.replace(" owner", "", regex=False)

cars['owner'] = cars['owner'].str.strip()
cars['owner'].unique()

array(['3rd', '2nd', '1st', '5th', '4th', '7th', '6th'], dtype=object)

In [27]:
# Step 2: Add the correct format only once
cars['owner'] = cars['owner'].apply(lambda x: f"{x} owner")

# Check unique values
cars['owner'].unique()

array(['3rd owner', '2nd owner', '1st owner', '5th owner', '4th owner',
       '7th owner', '6th owner'], dtype=object)

### Cleaning `transmission` Column

---

In [28]:
# "transmission" column has nothing to clean, but to proceed without any error, we can strip the values to remove any extra spaces
cars['transmission'] = cars['transmission'].str.strip()

# Replace NaN with 'Automatic'
cars['transmission'] = cars['transmission'].fillna('Automatic')

cars['transmission'].unique()

array(['Manual', 'Automatic'], dtype=object)

In [29]:
# "transmission" column contains 2 types of values : "Auto" and "Manual"
# But Auto should be labeled as Automatic, which makes more sense, so we will update it
#cars['transmission'] = cars['transmission'].str.replace('Automatic','Automatic')
cars.head(6)

,km_driven,fuel_type,transmission,owner,engine_capacity,price,year,brand,model
0,46610,Petrol,Manual,3rd owner,814cc,₹1.76 lakh,2013,Hyundai,Eon
1,72110,Petrol,Manual,2nd owner,796cc,₹2.12 lakh,2014,Maruti,Alto 800
2,44480,Petrol,Manual,1st owner,998cc,₹3.37 lakh,2015,Maruti,Wagon R 1.0
3,75340,Petrol,Automatic,1st owner,1199cc,₹4.46 lakh,2018,Tata,Tiago
4,69740,Petrol,Manual,2nd owner,1197cc,₹2.63 lakh,2012,Hyundai,i20
5,53390,Diesel,Manual,1st owner,1493cc,₹14.42 lakh,2022,KIA,CARENS

### Cleaning `price` Column

---

In [30]:
# "price" column contains "₹" prefix
# To convert "price" into numerical datatype, we have to remove the "₹" prefix
cars['price'] = cars['price'].str.replace('₹','')
cars.head()

,km_driven,fuel_type,transmission,owner,engine_capacity,price,year,brand,model
0,46610,Petrol,Manual,3rd owner,814cc,1.76 lakh,2013,Hyundai,Eon
1,72110,Petrol,Manual,2nd owner,796cc,2.12 lakh,2014,Maruti,Alto 800
2,44480,Petrol,Manual,1st owner,998cc,3.37 lakh,2015,Maruti,Wagon R 1.0
3,75340,Petrol,Automatic,1st owner,1199cc,4.46 lakh,2018,Tata,Tiago
4,69740,Petrol,Manual,2nd owner,1197cc,2.63 lakh,2012,Hyundai,i20

In [31]:
# "price" column contains 2 types of suffix : "lakh" or "Crore"
cars['price'].str.split(' ').str.get(1).unique()

array(['lakh'], dtype=object)

In [32]:
# Importing price_cleaner function from helpers module
from helpers import price_cleaner

In [33]:
# Applying price_cleaner function on "price" column
cars.loc[:,'price'] = cars.loc[:,'price'].apply(price_cleaner)
cars.head()

,km_driven,fuel_type,transmission,owner,engine_capacity,price,year,brand,model
0,46610,Petrol,Manual,3rd owner,814cc,176000,2013,Hyundai,Eon
1,72110,Petrol,Manual,2nd owner,796cc,212000,2014,Maruti,Alto 800
2,44480,Petrol,Manual,1st owner,998cc,337000,2015,Maruti,Wagon R 1.0
3,75340,Petrol,Automatic,1st owner,1199cc,446000,2018,Tata,Tiago
4,69740,Petrol,Manual,2nd owner,1197cc,263000,2012,Hyundai,i20

In [38]:
# "engine_capacity" column contains "cc" suffix
# To convert "engine_capacity" into numerical datatype, we have to remove the "cc" suffix
cars['engine_capacity'] = cars['engine_capacity'].str.replace('cc','').astype(float)
cars.head()

,km_driven,fuel_type,transmission,owner,engine_capacity,price,year,brand,model
0,46610,Petrol,Manual,3rd owner,814.0,176000,2013,Hyundai,Eon
1,72110,Petrol,Manual,2nd owner,796.0,212000,2014,Maruti,Alto 800
2,44480,Petrol,Manual,1st owner,998.0,337000,2015,Maruti,Wagon R 1.0
3,75340,Petrol,Automatic,1st owner,1199.0,446000,2018,Tata,Tiago
4,69740,Petrol,Manual,2nd owner,1197.0,263000,2012,Hyundai,i20

In [39]:
# Null values in "engine_capacity" column
print(f"Total NULL values in 'engine capacity' column : {cars['engine_capacity'].isna().sum()}")

Total NULL values in 'engine capacity' column : 378

In [40]:
# "engine_capacity" column contains numerical values but in discrete form (like categories)
# So we can use the most occuring value (mode) to fill the Null values, instead of mean or median
cars['engine_capacity'].unique()

array([ 814.,  796.,  998., 1199., 1197., 1493., 1198.,  999.,   nan,
       1968.,  799., 2179., 1591., 1498., 1462., 1497., 1956., 1248.,
       1598., 1461., 1086., 1496., 1194., 1499., 1451., 1997., 1373.,
       1999., 1368., 1349., 1353., 1582., 1984., 1490., 1047., 1798.,
       1396., 1196., 2993., 1399.,  624.,  627., 2498., 1794., 1186.,
       1120., 1061., 1995., 1586., 2184., 1405., 1193.,  936., 1482.,
       2489., 1330., 1364., 2494., 2183., 2393., 1799., 2499., 1596.,
        995., 1599., 1991., 1796., 1172., 2477., 2755., 1998., 1797.,
       2982., 2596., 2149., 2523., 1597., 2143., 2953., 2199., 1595.,
       2967., 4134., 2987., 2694., 2157., 1395., 1986., 1150., 1495.,
       2696., 2354., 2400., 3604., 2999., 1996.])

In [41]:
# We are calculating global mode of "engine_capacity" column
# Because there might be some car brand that only have a single car in the data (infrequent category)
# So we will replace those "engine_capacity" values with global mode

global_mode = cars['engine_capacity'].mode()[0]
print(f"Global Mode : {global_mode}")

Global Mode : 1197.0

In [42]:
# Filling the Null values in "engine_capacity" column by grouping data by "brand" column
# And using the most frequent "engine_capacity" value per brand to fill the Null values
# If there are no most frequent "engine_capacity" value per brand, we will use the global mode to fill those values
cars['engine_capacity'] = cars.groupby(by='brand')['engine_capacity'].transform(lambda x: x.fillna(x.mode()[0] if not x.mode().empty else global_mode))
cars.head()

,km_driven,fuel_type,transmission,owner,engine_capacity,price,year,brand,model
0,46610,Petrol,Manual,3rd owner,814.0,176000,2013,Hyundai,Eon
1,72110,Petrol,Manual,2nd owner,796.0,212000,2014,Maruti,Alto 800
2,44480,Petrol,Manual,1st owner,998.0,337000,2015,Maruti,Wagon R 1.0
3,75340,Petrol,Automatic,1st owner,1199.0,446000,2018,Tata,Tiago
4,69740,Petrol,Manual,2nd owner,1197.0,263000,2012,Hyundai,i20

### Optimizing Memory Usage of DataFrame

---

In [45]:
# Detailed Memory Usage of DataFrame (For Overall DataFrame)
# It currently occupies approx 1MB of memory
cars.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Index: 4858 entries, 0 to 4869
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   km_driven        4858 non-null   object
 1   fuel_type        4855 non-null   object
 2   transmission     4858 non-null   object
 3   owner            4858 non-null   object
 4   engine_capacity  4858 non-null   float64
 5   price            4858 non-null   object
 6   year             4858 non-null   int64
 7   brand            4858 non-null   object
 8   model            4858 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 1.9 MB

In [46]:
# Column-wise Memory Usage
cars.memory_usage(deep=True)

Index               38864
km_driven          174888
fuel_type          305760
transmission       310065
owner              320628
engine_capacity     38864
price              174888
year                38864
brand              305438
model              307547
dtype: int64

In [47]:
# Actual space occupied by "km_driven" column
cars['km_driven'].memory_usage(deep=True)

213752

In [48]:
# DataType of "km_driven" column

In [51]:
cars['km_driven'].dtype

dtype('O')

In [52]:
# "price" is a numerical column but its datatype is object, so we will transform it
# Since the range of int64 is from –9 quintillion to +9 quintillion
# Which is totally unnecessary for "price" column
# int32 ranges from –2,147,483,648 to 2,147,483,647 which is more than enough
cars['price'].astype(np.int32).memory_usage(deep=True)

58296

In [54]:
# So we will update the datatype of "price" column to int32
cars['price'] = cars['price'].astype(np.int32)

In [55]:
# Actual space occupied by "year" column
cars['year'].memory_usage(deep=True)

77728

In [56]:
# DataType of "year" column
cars['year'].dtype

dtype('int64')

In [57]:
# Since the range of int64 is from –9 quintillion to +9 quintillion
# Which is totally unnecessary for "year" column
# int16 ranges from –32,768 to 32,768 which is more than enough
cars['year'].astype(np.int16).memory_usage(deep=True)

48580

In [58]:
# So we will update the datatype of "year" column to int16
cars['year'] = cars['year'].astype(np.int16)

In [59]:
# Actual space occupied by "engine_capacity" column
cars['engine_capacity'].memory_usage(deep=True)

77728

In [61]:

# DataType of "engine_capacity" column
cars['engine_capacity'].dtype

dtype('float64')

In [62]:
# Since the range of float64 is from 2.225074 × 10⁻³⁰⁸ to 1.797693 × 10³⁰⁸
# Which is totally unnecessary for "engine_capacity" column
# And because "engine_capacity" has null values while data cleaning, it was converted to float
# But now int datatype will be fine for "engine_capacity" column
# int16 ranges from –32,768 to 32,768 which is more than enough
cars['engine_capacity'].astype(np.int16).memory_usage(deep=True)

48580

In [63]:
# So we will update the datatype of "engine_capacity" column to int16
cars['engine_capacity'] = cars['engine_capacity'].astype(np.int16)

In [64]:
# Actual space occupied by "fuel_type" column
cars['fuel_type'].memory_usage(deep=True)

344624

In [65]:
# DataType of "fuel_type" column
cars['fuel_type'].dtype

dtype('O')

In [66]:
# Since "fuel_type" is a categorical column
# It's better to convert it into category datatype rather than object
# It will occupy significantly less space and be more efficent in operation like group by, merge, etc.
cars['fuel_type'].astype('category').memory_usage(deep=True)

44145

In [67]:
# So we will update the datatype of "fuel_type" column to category
cars['fuel_type'] = cars['fuel_type'].astype('category')

In [68]:
# Actual space occupied by "transmission" column
cars['transmission'].memory_usage(deep=True)

348929

In [69]:
# DataType of "transmission" column
cars['transmission'].dtype

dtype('O')

In [70]:
# Since "transmission" is a categorical column
# It's better to convert it into category datatype rather than object
# It will occupy significantly less space and be more efficent in operation like group by, merge, etc.
cars['transmission'].astype('category').memory_usage(deep=True)

43959

In [71]:
# So we will update the datatype of "transmission" column to category
cars['transmission'] = cars['transmission'].astype('category')

In [72]:
# Actual space occupied by "owner" column
cars['owner'].memory_usage(deep=True)

359492

In [73]:
# DataType of "owner" column
cars['owner'].dtype

dtype('O')

In [74]:
# Since "owner" is a categorical column
# It's better to convert it into category datatype rather than object
# It will occupy significantly less space and be more efficent in operation like group by, merge, etc.
cars['owner'].astype('category').memory_usage(deep=True)

44484

In [75]:
# So we will update the datatype of "owner" column to category
cars['owner'] = cars['owner'].astype('category')

In [76]:
# Actual space occupied by "model" column
cars['model'].memory_usage(deep=True)

346411

In [77]:
# DataType of "model" column
cars['model'].dtype

dtype('O')

In [78]:
# Since "model" is a categorical column (even though it contains 100s of unique category)
# It's better to convert it into category datatype rather than object
# It will occupy significantly less space and be more efficent in operation like group by, merge, etc.
# category datatype stores each unique string once, saving huge memory
# where object datatype stores each string as a full Python object in memory, which can occupy huge memory
cars['model'].astype('category').memory_usage(deep=True)

71651

In [79]:
# So we will update the datatype of "model" column to category
cars['model'] = cars['model'].astype('category')

In [80]:
# Actual space occupied by "brand" column
cars['brand'].memory_usage(deep=True)

344302

In [81]:
# DataType of "brand" column
cars['brand'].dtype

dtype('O')

In [82]:
# Since "brand" is a categorical column (even though it contains 10s of unique category)
# It's better to convert it into category datatype rather than object
# It will occupy significantly less space and be more efficent in operation like group by, merge, etc.
# category datatype stores each unique string once, saving huge memory
# where object datatype stores each string as a full Python object in memory, which can occupy huge memory
cars['brand'].astype('category').memory_usage(deep=True)

46744

In [83]:
# So we will update the datatype of "brand" column to category
cars['brand'] = cars['brand'].astype('category')

In [84]:
# Detailed Memory Usage of DataFrame after Optimization (For Overall DataFrame)
# It now occupies only 95KB of memory
cars.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Index: 4858 entries, 0 to 4869
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   km_driven        4858 non-null   object
 1   fuel_type        4855 non-null   category
 2   transmission     4858 non-null   category
 3   owner            4858 non-null   category
 4   engine_capacity  4858 non-null   int16
 5   price            4858 non-null   int32
 6   year             4858 non-null   int16
 7   brand            4858 non-null   category
 8   model            4858 non-null   category
dtypes: category(5), int16(2), int32(1), object(1)
memory usage: 302.0 KB

In [85]:
# Column-wise Memory Usage after Optimization
cars.memory_usage(deep=True)

Index               38864
km_driven          174888
fuel_type            5281
transmission         5095
owner                5620
engine_capacity      9716
price               19432
year                 9716
brand                7880
model               32787
dtype: int64

In [86]:
# Resetting Index 
cars.reset_index(drop=True, inplace=True)

### Exporting Cleaned DataFrame as Parquet File

---

In [88]:
# Importing export_as_parquet function from export_data module
from export_data import export_as_parquet
export_as_parquet(cars, 'clean_data', 'clean_data.parquet')

Successfully exported the DataFrame as 'clean_data.parquet'